#!/usr/bin/perl -w

$phrase 				= 'HELLO, WORLD!'; 								# Присвоить значение скалярной переменной.
@arr 					= ('Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'); 	# Присвоить значение массиву переменной.
($one, $two, $three) 	= @arr;											# Присвоить значение списку скалярных переменных.

%hash 					= (												# Присвоить значение хешу.
	'Пн' => 'Понедельник',
	'Вт' => 'Вторник',
	'Ср' => 'Среда',
	'Чт' => 'Четверг',
	'Пт' => 'Пятница',
	'Сб' => 'Суббота',
	'Вс' => 'Воскресенье',
);

print "Content-type: text/html\n\n";
print "<html><head><title>Опыты с Perl</title></head><body>";
print "$phrase<br />"; 													# Вывести  переменную.
print $arr[0] . ', ' . $arr[1] . ', ' . $arr[2] . '<br />';
print $one . ', ' . $two . ', ' . $three . '<br />';
print $hash{$one} . ', ' . $hash{$two} . ', ' . $hash{$three} . ', ' . $hash{$arr[3]} . ', ' . $hash{$arr[4]} . ', ' . $hash{$arr[5]} . ', ' . $hash{'Вс'} . '<br />';
foreach $k (sort(keys @arr)) {
	print $k . ' = ' . $arr[$k] . '<br />';
}
foreach $k (sort(keys %hash)) {
	print $k . ' = ' . $hash{$k} . '<br />';
}
print $hash_keys;
print '<hr />';

# ==========================================================================================

%wife = (
	'Адам' 	=> 'Ева',
	'Иаков'	=> ['Лия', 'Рахиль', 'Валла', 'Зелфа']
);

print $wife{'Иаков'}[0] . '<br />';

%kids_of_wife = (
	'Иаков' => {
		'Лия' 		=> ['Рувин', 'Симеон', 'Левий', 'Иуда', 'Иссахар', 'Завулон'],
		'Рахиль' 	=> ['Иосиф', 'Венимамин'],
		'Валла' 	=> ['Дан', 'Неффалим'],
		'Зелфа' 	=> ['Гад', 'Асир']
	}
);

print $kids_of_wife{'Иаков'}{'Валла'}[1];

print "</body></head>";